# ============================================================
# Brewfile - Lotfy's Mac Setup
# Generated: 2026-02-20
# Usage: brew bundle --file=Brewfile
# ============================================================

# ---------------------------
# Taps
# ---------------------------
tap "homebrew/bundle"
tap "shivammathur/php"

# ---------------------------
# Formulae (CLI tools & libs)
# ---------------------------
brew "abseil"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "brotli"
brew "ca-certificates"
brew "curl"
brew "dav1d"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "gd"
brew "gettext"
brew "giflib"
brew "gmp"
brew "highway"
brew "icu4c@78"
brew "imath"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "krb5"
brew "libavif"
brew "libdeflate"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libpng"
brew "libpq"
brew "libsodium"
brew "libssh2"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libvmaf"
brew "libzip"
brew "little-cms2"
brew "lz4"
brew "m4"
brew "mysql"
brew "net-snmp"
brew "oniguruma"
brew "openexr"
brew "openjph"
brew "openldap"
brew "openssl@3"
brew "pcre2"
brew "php"
brew "php@8.0", link: false
brew "php@8.2", link: false
brew "protobuf"
brew "readline"
brew "sqlite"
brew "tidy-html5"
brew "unixodbc"
brew "webp"
brew "xz"
brew "zlib"
brew "zstd"

# ---------------------------
# Casks (GUI Applications)
# ---------------------------
cask "alt-tab"
cask "cleanshot"
cask "docker-desktop"    # Docker Desktop (replaces Docker.app)
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "localsend"
cask "rectangle"
cask "stats"
cask "time-out"

# ---------------------------
# VS Code Extensions
# ---------------------------
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
